mrsgit09Docset0516221715/articles/MS-SSAS/058bda87-16fe-427f-be36-67d7afe01e13.md

<html dir="LTR" xmlns:mshelp="http://msdn.microsoft.com/mshelp" xmlns:ddue="http://ddue.schemas.microsoft.com/authoring/2003/5" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:tool="http://www.microsoft.com/tooltip">
    <head>
        <meta http-equiv="Content-Type" content="text/html; CHARSET=utf-8"></meta>
        <meta name="save" content="history"></meta>
        <title>4.7.1 Client Sends Request</title>
        <xml>
            <mshelp:toctitle title="4.7.1 Client Sends Request"></mshelp:toctitle>
            <mshelp:rltitle title="[MS-SSAS]: Client Sends Request"></mshelp:rltitle>
            <mshelp:keyword index="A" term="058bda87-16fe-427f-be36-67d7afe01e13"></mshelp:keyword>
            <mshelp:attr name="DCSext.ContentType" value="open specification"></mshelp:attr>
            <mshelp:attr name="AssetID" value="058bda87-16fe-427f-be36-67d7afe01e13"></mshelp:attr>
            <mshelp:attr name="TopicType" value="kbRef"></mshelp:attr>
            <mshelp:attr name="DCSext.Title" value="[MS-SSAS]: Client Sends Request" />
        </xml>
    </head>
    <body>
        <div id="header">
            <h1 class="heading">4.7.1 Client Sends Request</h1>
        </div>
        <div id="mainSection">
            <div id="mainBody">
                <div id="allHistory" class="saveHistory"></div>
                <div id="sectionSection0" class="section" name="collapseableSection">
                    

<p>The client sends the following request:</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;XA:Session soap:mustUnderstand=&quot;1&quot; SessionId=&quot;09157399-DA20-4FB7-A316-E7EC153F3BE6&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:XA=&quot;urn:schemas-microsoft-com:xml-analysis&quot; /&gt;
   &lt;/Header&gt;
   &lt;Body&gt;
     &lt;Discover xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;RequestType&gt;DISCOVER_CONNECTIONS&lt;/RequestType&gt;
       &lt;Restrictions&gt;&lt;/Restrictions&gt;
       &lt;Properties&gt;
         &lt;PropertyList&gt;
           &lt;Content&gt;Data&lt;/Content&gt;
         &lt;/PropertyList&gt;
       &lt;/Properties&gt;
     &lt;/Discover&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>


                </div>
            </div>
        </div>
    </body>
</html>